<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.9.0">
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
<title>软考论文写作练习1 —— 论软件系统建模方法及其应用 - 一典</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<!-- <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css"> -->
<link rel="stylesheet" href="/css/outdatedbrowser.min.css">


<link href="/2024-May-11th-Software-exam-article/" rel="alternate" hreflang="en">
    






    <meta name="description" content="&amp;#x6458;&amp;#x8981;&amp;#xFF1A;2023&amp;#x5E74;9&amp;#x6708;-12&amp;#x6708;&amp;#xFF0C;&amp;#x672C;&amp;#x4EBA;&amp;#x53C2;&amp;#x4E0E;&amp;#x4E86;&amp;#x67D0;&amp;#x5927;&amp;#x578B;&amp;#x4F01;&amp;#x4E1A;&amp;#x6D77;&amp;#x5916;&amp;#x76F4;&amp;#x8425;&amp;#x5546;&amp;#x57CE;&amp;#x9879;">
<meta name="keywords" content="软考">
<meta property="og:type" content="article">
<meta property="og:title" content="软考论文写作练习1 —— 论软件系统建模方法及其应用">
<meta property="og:url" content="https://BillyStudio.github.io/zh-cn/2024-May-11th-Software-exam-article/index.html">
<meta property="og:site_name" content="Shane&#39;s Blog">
<meta property="og:description" content="&amp;#x6458;&amp;#x8981;&amp;#xFF1A;2023&amp;#x5E74;9&amp;#x6708;-12&amp;#x6708;&amp;#xFF0C;&amp;#x672C;&amp;#x4EBA;&amp;#x53C2;&amp;#x4E0E;&amp;#x4E86;&amp;#x67D0;&amp;#x5927;&amp;#x578B;&amp;#x4F01;&amp;#x4E1A;&amp;#x6D77;&amp;#x5916;&amp;#x76F4;&amp;#x8425;&amp;#x5546;&amp;#x57CE;&amp;#x9879;">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2024-10-20T05:05:44.650Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="软考论文写作练习1 —— 论软件系统建模方法及其应用">
<meta name="twitter:description" content="&amp;#x6458;&amp;#x8981;&amp;#xFF1A;2023&amp;#x5E74;9&amp;#x6708;-12&amp;#x6708;&amp;#xFF0C;&amp;#x672C;&amp;#x4EBA;&amp;#x53C2;&amp;#x4E0E;&amp;#x4E86;&amp;#x67D0;&amp;#x5927;&amp;#x578B;&amp;#x4F01;&amp;#x4E1A;&amp;#x6D77;&amp;#x5916;&amp;#x76F4;&amp;#x8425;&amp;#x5546;&amp;#x57CE;&amp;#x9879;">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<!-- <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css"> -->
<link rel="stylesheet" href="/css/bulma.min.css">


<!-- <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css"> -->
<link rel="stylesheet" href="/css/lightgallery.min.css">
<!-- <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css"> -->
<link rel="stylesheet" href="/css/justifiedGallery.min.css">


<!-- <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css"> -->
<link rel="stylesheet" href="/css/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->


    
    

    
    
    
    

    
    

    
    

    


</head>
<body>
    
<!-- hexo-inject:begin --><!-- hexo-inject:end --><nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/zh-cn">
                
                <img src="/images/logo.png" alt height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/zh-cn/categories">分类</a>
            
            <a class="navbar-item " href="/zh-cn/tags">标记</a>
            
            <a class="navbar-item " href="/zh-cn/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
	    
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu" style="top:100%">
            <div class="dropdown-content">
            
                <a href="/2024-May-11th-Software-exam-article/" class="dropdown-item">
                    English
                </a>
            
                <a href="/zh-cn/2024-May-11th-Software-exam-article/" class="dropdown-item">
                    简体中文
                </a>
            
            </div>
        </div>
    </div>
</div>


        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            软考论文写作练习1 —— 论软件系统建模方法及其应用
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2024-05-11T15:40:22.000Z" itemprop="datePublished">5月 11 2024</time>
            
        </span>
        
        
        <span class="column is-narrow">
            
            
            10 分钟 读完 (约 1564 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p>&#x6458;&#x8981;&#xFF1A;<br>2023&#x5E74;9&#x6708;-12&#x6708;&#xFF0C;&#x672C;&#x4EBA;&#x53C2;&#x4E0E;&#x4E86;&#x67D0;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x6D77;&#x5916;&#x76F4;&#x8425;&#x5546;&#x57CE;&#x9879;&#x76EE;&#x7684;&#x89C4;&#x5212;&#x3001;&#x8BBE;&#x8BA1;&#x4E0E;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x62C5;&#x4EFB;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x627F;&#x62C5;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5EFA;&#x6A21;&#x4E0E;&#x90E8;&#x5206;&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x662F;&#x672C;&#x5E74;&#x5EA6;&#x516C;&#x53F8;&#x91CD;&#x70B9;&#x652F;&#x6491;&#x7684;&#x4E1A;&#x52A1;&#x9879;&#x76EE;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x5728;&#x4E00;&#x5E74;&#x5185;&#x5B8C;&#x6210;&#x6D77;&#x5916;&#x9500;&#x552E;&#x7F51;&#x7EDC;&#x7684;&#x642D;&#x5EFA;&#x5E76;&#x5728;&#x82E5;&#x5E72;&#x91CD;&#x70B9;&#x56FD;&#x5BB6;&#x8BD5;&#x7528;&#xFF0C;&#x7279;&#x70B9;&#x662F;&#x65F6;&#x95F4;&#x7D27;&#x5F20;&#x3001;&#x9700;&#x6C42;&#x660E;&#x786E;&#x3001;&#x6784;&#x4EF6;&#x5145;&#x5206;&#xFF0C;&#x53C2;&#x4E0E;&#x4EBA;&#x5458;&#x5927;&#x591A;&#x4E3A;&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x7EBF;&#x7684;&#x9AA8;&#x5E72;&#x6210;&#x5458;&#x3002;<br>&#x5728;Web&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x9886;&#x57DF;&#x4E2D;&#xFF0C;&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x5EFA;&#x6A21;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;&#x3001;&#x6570;&#x636E;&#x5E93;&#x5EFA;&#x6A21;&#x662F;&#x6BD4;&#x8F83;&#x901A;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x3002;&#x6BCF;&#x79CD;&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x6709;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x9002;&#x7528;&#x573A;&#x666F;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x3001;&#x9010;&#x6B65;&#x6C42;&#x7CBE;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x9700;&#x6C42;&#x660E;&#x786E;&#xFF0C;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x5B9A;&#x4E49;&#x6E05;&#x6670;&#x7684;&#x573A;&#x666F;&#xFF1B;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;&#x5177;&#x6709;&#x53CD;&#x6620;&#x5BA2;&#x89C2;&#x4E16;&#x754C;&#x548C;&#x7CFB;&#x7EDF;&#x56FA;&#x6709;&#x7684;&#x4E8B;&#x7269;&#x53CA;&#x5176;&#x76F8;&#x4E92;&#x5173;&#x7CFB;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x5B9E;&#x4F53;&#x8FB9;&#x754C;&#x6E05;&#x6670;&#x3001;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x77ED;&#x7684;&#x573A;&#x666F;&#xFF1B;&#x6570;&#x636E;&#x5E93;&#x5EFA;&#x6A21;&#x53C8;&#x79F0;&#x4E3A;&#x4FE1;&#x606F;&#x5DE5;&#x7A0B;&#x5EFA;&#x6A21;&#xFF0C;&#x5177;&#x6709;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5904;&#x7406;&#x3001;&#x5206;&#x6790;&#x7C7B;&#x7684;&#x573A;&#x666F;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x9879;&#x76EE;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7EFC;&#x5408;&#x91C7;&#x7528;&#x4E86;&#x7ED3;&#x6784;&#x5316;&#x5EFA;&#x6A21;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6D41;&#x56FE;&#x3001;&#x6570;&#x636E;&#x5B57;&#x5178;&#x3001;UML&#x3001;&#x7518;&#x7279;&#x56FE;&#x7B49;&#x5DE5;&#x5177;&#xFF0C;&#x5728;&#x89C4;&#x5B9A;&#x671F;&#x9650;&#x5185;&#x5B8C;&#x6210;&#x4E86;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0A;&#x7EBF;&#x8FC7;&#x7A0B;&#x6BD4;&#x8F83;&#x987A;&#x5229;&#xFF0C;&#x5706;&#x6EE1;&#x8FBE;&#x6210;&#x4E86;&#x9879;&#x76EE;&#x89C4;&#x5212;&#x76EE;&#x6807;&#x3002;<br>&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x4E3A;&#x5F00;&#x53D1;&#x5927;&#x578B;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x5316;&#x7684;&#x5DE5;&#x5177;&#x4E0E;&#x6307;&#x5BFC;&#x601D;&#x8DEF;&#xFF0C;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#xFF0C;&#x53EF;&#x4EE5;&#x8D77;&#x5230;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5728;&#x4ECA;&#x540E;&#x7684;&#x5F00;&#x53D1;&#x6D3B;&#x52A8;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x7EE7;&#x7EED;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x8FD0;&#x7528;&#x597D;&#x6B64;&#x7C7B;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x6B63;&#x6587;&#xFF1A;<br>&#x4E3A;&#x4E86;&#x54CD;&#x5E94;&#x56FD;&#x5BB6;&#x9F13;&#x52B1;&#x4F01;&#x4E1A;&#x51FA;&#x6D77;&#x6218;&#x7565;&#xFF0C;&#x540C;&#x65F6;&#x62D3;&#x5C55;&#x6D77;&#x5916;&#x5E02;&#x573A;&#xFF0C;&#x5BFB;&#x627E;&#x65B0;&#x7684;&#x589E;&#x957F;&#x70B9;&#xFF0C;&#x672C;&#x4EBA;&#x6240;&#x5728;&#x7684;&#x67D0;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x51B3;&#x5B9A;&#x5728;23&#x5E74;&#x5B8C;&#x6210;&#x8DE8;&#x5883;&#x5728;&#x7EBF;&#x76F4;&#x8425;&#x5546;&#x57CE;&#x7684;&#x5EFA;&#x8BBE;&#x3002;&#x7531;&#x6280;&#x672F;&#x8D1F;&#x8D23;&#x4EBA;&#x7275;&#x5934;&#x7EC4;&#x6210;&#x4E86;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5C0F;&#x7EC4;&#x3002;&#x8BE5;&#x7CFB;&#x7EDF;&#x4EE5;&#x5FAE;&#x670D;&#x52A1;&#x7CFB;&#x7EDF;&#x4E3A;&#x540E;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x652F;&#x6301;&#x7F51;&#x9875;&#x3001;&#x5C0F;&#x7A0B;&#x5E8F;&#x3001;app&#x591A;&#x7AEF;&#x4F7F;&#x7528;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x5728;&#x89C4;&#x5B9A;&#x671F;&#x9650;&#x5185;&#x5B8C;&#x6210;&#x9879;&#x76EE;&#x76EE;&#x6807;&#xFF0C;&#x4ECE;&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x7EBF;&#x4E00;&#x5171;&#x6311;&#x9009;&#x4E86;&#x7EA6;&#x51E0;&#x5341;&#x4F4D;&#x9AA8;&#x5E72;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#x3002;&#x6211;&#x4F5C;&#x4E3A;&#x7CFB;&#x7EDF;&#x4F9B;&#x5E94;&#x94FE;&#x4FA7;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5E08;&#x53C2;&#x4E0E;&#x4E86;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x90E8;&#x5206;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x89C4;&#x5212;&#x3001;&#x8BBE;&#x8BA1;&#x4E0E;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x4E86;&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x662F;&#x5728;&#x5B9E;&#x65BD;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x62BD;&#x8C61;&#x8868;&#x8FBE;&#x3002;&#x8FD9;&#x65B9;&#x4FBF;&#x4E86;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x540C;&#x65F6;&#x6709;&#x5229;&#x4E8E;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8BF4;&#x660E;&#x4E66;&#x7684;&#x7F16;&#x5199;&#x3002;&#x5F53;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x7C7B;&#xFF1A;<br>&#x4E00;&#x3001;&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x5EFA;&#x6A21;<br>&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x5EFA;&#x6A21;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x3001;&#x9010;&#x6B65;&#x6C42;&#x7CBE;&#x7684;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#xFF0C;&#x4ED6;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x65E9;&#xFF0C;&#x76F8;&#x5173;&#x7684;&#x7406;&#x8BBA;&#x548C;&#x5DE5;&#x5177;&#x4E5F;&#x76F8;&#x5F53;&#x6210;&#x719F;&#x3002;&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x7684;&#x7279;&#x70B9;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x3001;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5757;&#x9010;&#x5C42;&#x5206;&#x6790;&#xFF0C;&#x4E0D;&#x65AD;&#x7EC6;&#x5316;&#x5230;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x9002;&#x7528;&#x4E8E;&#x6709;&#x660E;&#x786E;&#x9700;&#x6C42;&#x7684;&#x573A;&#x666F;&#x3002;<br>&#x4E8C;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;<br>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;&#x662F;&#x5C06;&#x5BA2;&#x89C2;&#x4E16;&#x754C;&#x7684;&#x56FA;&#x6709;&#x4E8B;&#x7269;&#x4E0E;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7C7B;&#x5173;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5EFA;&#x6A21;&#x4E3B;&#x8981;&#x7531;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x6790;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E24;&#x9636;&#x6BB5;&#x7EC4;&#x6210;&#x3002;<br>&#x4E09;&#x3001;&#x6570;&#x636E;&#x5E93;&#x5EFA;&#x6A21;<br>&#x6570;&#x636E;&#x5E93;&#x5EFA;&#x6A21;&#x53C8;&#x79F0;&#x4FE1;&#x606F;&#x5DE5;&#x7A0B;&#x5EFA;&#x6A21;&#xFF0C;&#x662F;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x6838;&#x5FC3;&#x6765;&#x8BBE;&#x8BA1;&#x548C;&#x6784;&#x9020;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x7684;&#x89C4;&#x5212;&#x4E0E;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x4E86;&#x5404;&#x79CD;&#x65B9;&#x6848;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x6700;&#x7EC8;&#x4F7F;&#x7528;&#x4E86;&#x57FA;&#x4E8E;&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x7684;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x548C;&#x57FA;&#x4E8E;&#x6784;&#x4EF6;&#x7684;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x76F8;&#x7ED3;&#x5408;&#x6765;&#x6784;&#x9020;&#x6211;&#x4EEC;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x901A;&#x8FC7;&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7CFB;&#x7EDF;&#x62C6;&#x5206;&#x4E3A;&#x8BE6;&#x60C5;&#x641C;&#x7D22;&#x8D2D;&#x7269;&#x8F66;&#x4EA4;&#x6613;&#x4E0B;&#x5355;&#x5BFC;&#x8D2D;&#x7B49;&#x6A21;&#x5757;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x518D;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x6784;&#x4EF6;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5229;&#x7528;&#x5DF2;&#x6709;&#x6784;&#x4EF6;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x3002;<br>&#x6784;&#x5EFA;&#x7EC4;&#x88C5;&#x6A21;&#x578B;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x6613;&#x62D3;&#x5C55;&#x3001;&#x6613;&#x91CD;&#x7528;&#x3001;&#x65B9;&#x4FBF;&#x5B89;&#x6392;&#xFF0C;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3002;&#x4F46;&#x4E5F;&#x5B58;&#x5728;&#x7740;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x6784;&#x5EFA;&#x9700;&#x8981;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E0D;&#x597D;&#x7684;&#x6784;&#x4EF6;&#x96BE;&#x4EE5;&#x91CD;&#x7528;&#xFF0C;&#x8FC7;&#x5206;&#x5F3A;&#x8C03;&#x91CD;&#x7528;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x727A;&#x7272;&#x5176;&#x4ED6;&#x6307;&#x6807;&#x5982;&#x6027;&#x80FD;&#xFF0C;&#x7B2C;&#x4E09;&#x65B9;&#x6784;&#x4EF6;&#x7684;&#x8D28;&#x91CF;&#x96BE;&#x4EE5;&#x4FDD;&#x8BC1;&#x7B49;&#x7F3A;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9009;&#x7528;&#x7684;&#x6784;&#x4EF6;&#x5747;&#x6765;&#x81EA;&#x4E8E;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7EF4;&#x62A4;&#x826F;&#x597D;&#x3001;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x6838;&#x5FC3;&#x5DF2;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x6A21;&#x5757;&#x3002;&#x5E76;&#x4E14;&#x4FDD;&#x7559;&#x4E86;&#x62D3;&#x5C55;&#x70B9;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x65B9;&#x4FBF;&#x5C06;&#x6765;&#x5B9A;&#x5236;&#x5316;&#x9700;&#x6C42;&#x7684;&#x62D3;&#x5C55;&#x3002;</p>
<p>&#x5728;&#x591A;&#x79CD;&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x7684;&#x6307;&#x5BFC;&#x4E0B;&#xFF0C;&#x9879;&#x76EE;&#x6700;&#x7EC8;&#x5982;&#x671F;&#x6309;&#x7EA6;&#x4E0A;&#x7EBF;&#x5E76;&#x8FD0;&#x884C;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x3002;&#x4E0A;&#x7EBF;&#x9636;&#x6BB5;&#x6CA1;&#x6709;&#x91CD;&#x5927;&#x7684;bug&#xFF0C;&#x7CFB;&#x7EDF;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x3002;&#x867D;&#x7136;&#x5728;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x673A;&#x623F;&#x90E8;&#x7F72;&#x5BFC;&#x81F4;&#x6D41;&#x91CF;&#x4E0D;&#x5747;&#x5300;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x901A;&#x8FC7;&#x8054;&#x7CFB;&#x8FD0;&#x7EF4;&#x53CA;&#x65F6;&#x89E3;&#x51B3;&#x6CA1;&#x6709;&#x9020;&#x6210;&#x91CD;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x9879;&#x76EE;&#x5F97;&#x5230;&#x4E86;&#x516C;&#x53F8;&#x4E0A;&#x4E0B;&#x4E00;&#x81F4;&#x7684;&#x597D;&#x8BC4;&#x672C;&#x4EBA;&#x4E5F;&#x56E0;&#x6B64;&#x83B7;&#x5F97;&#x4E86;&#x4F18;&#x79C0;&#x5458;&#x5DE5;&#x7684;&#x79F0;&#x53F7;&#x3002;&#x5728;&#x4ECA;&#x540E;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x7EE7;&#x7EED;&#x8DF5;&#x884C;&#x8F6F;&#x4EF6;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x5176;&#x8FD0;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4E2D;&#x6307;&#x5BFC;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;&#x4E3A;&#x7956;&#x56FD;&#x7684;&#x793E;&#x4F1A;&#x4E3B;&#x4E49;&#x73B0;&#x4EE3;&#x5316;&#x8F6F;&#x4EF6;&#x5EFA;&#x8BBE;&#x7EE7;&#x7EED;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x7684;&#x529B;&#x91CF;&#x3002;</p>

    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/zh-cn/tags/软考/">#软考</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/zh-cn/2024-May-26th-Business-logic-development-experience/">业务开发经验之谈</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/zh-cn/2024-Mar-30th-Photograph-post-processing/">摄影八讲之六 - 后期修图篇</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="addthis_inline_share_toolbox"></div>
<script type="text/javascript" src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-6245c10135f53567"></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<div id="disqus_thread">
    
    <div class="notification is-danger">
        You forgot to set the <code>shortname</code> for Disqus. Please set it in <code>_config.yml</code>.
    </div>
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2025 Shane Wang&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
        </div>
    </div>
</footer>
<script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-8571410903510418" crossorigin="anonymous"></script>

    <!-- <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script> -->
<script src="/js/jquery.min.js"></script>
<!-- <script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script> -->
<script src="/js/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<!-- <script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script> -->
<script src="/js/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<!-- <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script> -->
<script src="/js/MathJax.js"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>


    
    
    
    
<!-- <script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script> -->
<script src="/js/lightgallery-all.min.js"></script>
<!-- <script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script> -->
<script src="/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>


    
    
    <!-- <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script> -->
    <script src="/js/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>


    
    

    


<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.zh-cn.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
    
</body>
</html>